In [14]:
#importing libraries
import pandas as pd
import matplotlib.pyplot as plt

In [15]:
from datasets import load_dataset
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

In [16]:
#data cleanup
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

In [17]:
df.loc[ 0:10 , 'salary_year_avg':'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0               NaN              NaN
1               NaN              NaN
2               NaN              NaN
3               NaN              NaN
4               NaN              NaN
5               NaN              NaN
6               NaN              NaN
7               NaN              NaN
8               NaN              NaN
9               NaN              NaN
10              NaN              NaN

In [18]:
salary_year_median = df['salary_year_avg'].median()
salary_hour_median = df['salary_hour_avg'].median()

In [19]:
df_filled = df

In [20]:
df_filled['salary_year_avg'] = df_filled['salary_year_avg'].fillna(salary_year_median)
df_filled['salary_hour_avg'] = df_filled['salary_hour_avg'].fillna(salary_hour_median)

In [21]:
df_filled.loc[0:10, 'salary_year_avg': 'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0          115000.0            45.98
1          115000.0            45.98
2          115000.0            45.98
3          115000.0            45.98
4          115000.0            45.98
5          115000.0            45.98
6          115000.0            45.98
7          115000.0            45.98
8          115000.0            45.98
9          115000.0            45.98
10         115000.0            45.98

In [22]:
df_unique = df_filled

In [23]:
df_unique = df_unique.drop_duplicates()

In [24]:
print('lenght of original df:', len(df_filled))
print('length of dropped duplicates df:', len(df_unique))
print('rows dropped :', len(df_filled)- len(df_unique))

lenght of original df: 785741
length of dropped duplicates df: 785640
rows dropped : 101

In [25]:
df_unique = df_unique.drop_duplicates(subset= ['job_title', 'company_name'])

In [26]:
print('lenght of original df:', len(df_filled))
print('length of dropped duplicates df:', len(df_unique))
print('rows dropped :', len(df_filled)- len(df_unique))

lenght of original df: 785741
length of dropped duplicates df: 508042
rows dropped : 277699